// Завдання 1

// Написати розв’язок нижче описаного завдання (по одному рядку коду на кожний пункт)
// 1.	Створіть змінну city з типом даних string.
// 2.	Присвойте їй значення «Київ».
// 3.	Змініть значення змінної city на «Львів».
// 4.	Створіть змінну address з типом даних string і скопіюйте в неї значення змінної city.
// 5.	Вивести значення змінної address з допомогою команди console.log().

// let city:string;
// city = "Київ";
// city = "Львів";
// let address:string = city;
// console.log(address);







// Завдання 2

// Використовуючи конструкцію if..else через тернарний вираз, напишіть код, який отримує число через prompt, а потім виводить в console.log() повідомлення:
// 1.	Число парне.
// 2.	Число непарне.
// 3.	Число 0.

// let numberUser: number = +prompt('Введіть число');
// let message:string = (numberUser == 0) ? "Число 0" : (numberUser % 2 == 0 ) ? "Число парне" : "Число непарне";
// console.log(message);





// Завдання 3

// Написати розв’язок нижче описаного завдання за допомогою function declaration:
// 1.	Потрібно створити функцію, яка повертає максимальний переданий їй числовий параметр.
// 2.	Кількість параметрів у функції може бути від 2х і більше.
// Приклад роботи:
// 1.	max(5,-2) – має повернути 5.
// 2.	max(5,-2, 30, 6) – має повернути 30


// function max(...arg: Array<number>): number {
//     return Math.max(...arg);
// }
// console.log(max(2, -3, 5));
// console.log(max(-35, 50, 555, 52));


// Завдання 4
// Напишіть функцію getSqrt(number), яка вираховує корінь квадратний. Для визначення кореня використовуйте Math. В залежності від того що передали
// в функцію має виводити наступні повідомлення:
// •	Якщо передане число повертати - Квадратний корінь з стільки то дорівнює стільки то.
// •	Якщо передали не число - Повинно бути числове значення.
// •	Якщо число менше 0 - Введіть додатнє число.
// •	Якщо в функцію нічого не передали - Будь ласка, введіть число!


function getSqrt(number: any): string|number {
    if (typeof number === 'number') {
        if (number < 0) {
            return 'Введіть додатне число';
        } else {
            return  Math.sqrt(number)
        }
    } else if (number === '') {
        return 'Будь ласка, введіть число!'
    } else {
        return 'Повинно бути числове значення'
    }

}
console.log(getSqrt(9));
console.log(getSqrt('some text'));
console.log(getSqrt(-25));
console.log(getSqrt(''));
